Can't make type "[Family Name]". It will be deleted. Failing family has been saved to "[File Name]"
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DeletingBadFamTypeDumped { get; }
  Visual Basic
Public Shared ReadOnly Property DeletingBadFamTypeDumped As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DeletingBadFamTypeDumped {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace